import pytest


@pytest.fixture
def valid_card_number() -> str:
    # Возвращаем правильный номер карты
    return "7000792289606361"


@pytest.fixture
def invalid_card_numbers() -> list:
    # Список неправильных номеров карт для проверки ошибок
    return [
        "123456789012345",  # Длина меньше 16 символов
        "12345678901234567",  # Длина больше 16 символов
        "abcde1234567890",  # Нецифровой символ
        "!@#$%^&*()_+",  # Символы вне диапазона чисел
        "",  # Пустая строка
    ]


@pytest.fixture
def valid_account_number() -> str:
    # Возвращаем правильный номер счёта
    return "73654108430135874305"


@pytest.fixture
def invalid_account_numbers() -> list:
    # Список неправильных номеров счетов для проверки ошибок
    return [
        "1234567890123456789",  # Длина меньше 20 символов
        "123456789012345678901",  # Длина больше 20 символов
        "abcde1234567890",  # Нецифровой символ
        "!@#$%^&*()_+",  # Символы вне диапазона чисел
        "",  # Пустая строка
    ]
